tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "asdf"
brew "bash"
brew "bat"
brew "coreutils"
brew "direnv"
brew "docker-completion"
brew "exa"
brew "findutils"
brew "fzf"
brew "gettext"
brew "gawk"
brew "gh"
brew "ghq"
brew "ghr"
brew "git"
brew "git-secrets"
brew "gnupg"
brew "gnu-sed"
brew "grep"
brew "jq"
brew "lazygit"
brew "pinentry-mac"
brew "shellcheck"
brew "starship"
brew "trash"
brew "vim"

cask "alfred"
cask "authy"
cask "bitwarden"
cask "docker"
cask "font-sauce-code-pro-nerd-font"
cask "google-chrome"
cask "google-japanese-ime"
cask "hhkb-keymap-tool"
cask "iterm2"
cask "postman"
cask "ticktick"
cask "visual-studio-code"
