tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "asdf"
brew "fzf"
brew "gettext"
brew "git"
brew "git-secrets"
brew "gnupg"
brew "jq"
brew "openjdk"
brew "starship"
brew "vim"
brew "zsh"

cask "adoptopenjdk11"
cask "adoptopenjdk13"
cask "alfred"
cask "authy"
cask "bitwarden"
cask "browserstacklocal"
cask "docker"
cask "hhkb-keymap-tool"
cask "iterm2"
cask "kindle"
cask "nosql-workbench-for-amazon-dynamodb"
cask "postman"
cask "visual-studio-code"
cask "zoom"
